#### 1. How many actors are there with the last name ‘Wahlberg’?         -- #2 actors--

SELECT*
FROM actor
WHERE last_name = 'Wahlberg'

#### 2. How many payments were made between $3.99 and 5.99?    -- 5607 payments were made--

In [ ]:
SELECT COUNT (amount)
FROM payment 
WHERE amount BETWEEN 3.99 AND 5.99	-- Answer 5607 payments affected.

#### 3. What film does the store have the most of... (copies?) (search in inventory)

In [ ]:
SELECT title
FROM film 
WHERE film_id	
IN (SELECT film_id COUNT FROM inventory GrOUP BY film_id HAVING COUNT(*)>=8);

#### 4. How many customers have the last name ‘William’? -- # Zero customers

In [ ]:
SELECT*
FROM customer
WHERE last_name = 'William'          -- Answer # None

#### 5. What store employee (get the id) sold the most rentals?

In [ ]:
SELECT staff_id
FROM rental	16044 rows affected.

SELECT COUNT(staff_id)
FROM rental
GROUP BY staff_id.rental =   -- 8040 rentals store 
because the store #1 have  most sales Mike Higllier with an emplooyee ID 1 sold the most

#### OR

In [ ]:
SELECT staff.staff_id, staff.username, SUM (payment.amount)
FROM staff
JOIN payment ON staff.staff_id = payment.staff_id
GROUP BY staff.staff_id, staff.username

#### 6. How many different district names are there? --  # 378 rows affected.--

In [ ]:
SELECT COUNT (DISTINCT district)
FROM public.address           -- Answer 378 different district names

#### 7. What film has the most actors in it? (use film_actor table and get film_id)

In [ ]:
-- SELECT MAX (actor_id)
-- FROM film_actor


-- SELECT actor_id, film_id 
-- FROM film_actor
-- ORDER BY actor_id, film_id;

#### 8. From store_id 1, how many customers have a last name ending with ‘es’? (use customer table)

-- SELECT last_name
-- FROM customer
-- WHERE last_name LIKE '%es'  			   -- Answer 21 rows 

-- SELECT store_id=1,last_name
-- FROM customer
-- WHERE last_name LIKE '%es'               -- Answer 13 customers from  store id 1

####  9. How many payment amounts (4.99, 5.99, etc.) had a number of rentals above 250 for customers
-- with ids between 380 and 430? (use group by and having > 250)

In [ ]:
SELECT payment.amount, COUNT (rental.rental_id) as rental_count
FROM payment 
JOIN rental ON payment.customer_id = rental.customer_id
WHERE payment.customer_id BETWEEN 380 and 430
GROUP BY payment.amount
HAVING COUNT(rental.rental_id) >250
ORDER BY rental_count DESC;

####  10. Within the film table, how many rating categories are there?  -- 5 rating categories And what rating has the most movies total?						 
                                                                          -- PG-13 has 223

In [ ]:
-- SELECT DISTINCT rating 
-- FROM film								 -- Answer #5 rating categories


-- SELECT rating, COUNT(rating)
-- FROM film
-- GROUP BY rating 							 -- Answer PG-13 has 223

#### 11. How many districts do they service?

In [ ]:
SELECT DISTINCT district FROM address     -- Answer 378

#### 12. How many records were made from Abu Dhabi?

In [ ]:
SELECT *
FROM city
WHERE city
LIKE 'Abu Dhabi'                             -- Answer 1

#### 13. Retrive all cities that starts with a letter 'P'.

In [ ]:
SELECT *
FROM city
WHERE city
LIKE 'P%'

#### 14. Retrive all cities that starts with a letter 'P' and a thrird letter is 'o'.

In [ ]:
SELECT *
FROM city
WHERE city
LIKE 'P_o%'

#### 15. Retrive all cities that starts with a letter 'P' and ends with an 'a', as well have an 'o' as a 3rd letter.

In [ ]:
SELECT *
FROM city
WHERE city
LIKE 'P_o%a'

#### 16. Select all customers with a first name Peter.

In [ ]:
SELECT *
FROM customer
WHERE first_name = 'Peter'

####  17. Change the text of the columns from first_name, last_name to "First Name" and "Last Name" in customer table.

In [ ]:
SELECT first_name 
AS "First Name", last_name AS "Last Name"
FROM customer

#### 18.  Concatinate two columns into one.

In [ ]:
SELECT CONCAT (first_name, '', last_name)
FROM customer

In [ ]:
SELECT CONCAT (first_name, '', last_name) AS "First, Last"
FROM customer

#### 19.  What is the max amount which were made by the customer.

In [ ]:
SELECT MAX (amount)
FROM payment

#### 20. Select all rental durations that were greater than 6 days.

In [ ]:
SELECT *
FROM film
WHERE rental_duration > 6

#### 21. Create a relationship between tables

In [ ]:
SELECT rental_id, rental_date, return_date, customer.customer_id, first_name, last_name
FROM rental
JOIN customer 
ON rental.customer_id = customer.customer_id;

 ---OR---

SELECT *
FROM rental
JOIN customer 
ON rental.customer_id = customer.customer_id;

#### 22. What ratings that are greater than 195?

In [ ]:
SELECT rating, COUNT(*)
FROM film 
GROUP BY rating
HAVING COUNT(*) >195

#### 23.

In [ ]:
SELECT rating, COUNT(*)
FROM film 
GROUP BY rating
ORDER BY COUNT (*)

#### 24. Join three tables

In [ ]:
SELECT rental.rental_id, rental.rental_date, rental.return_date, customer.customer_id, customer.first_name, customer.last_name, staff.staff_id, staff.first_name, staff.last_name
FROM rental 
JOIN customer ON rental.customer_id = customer.customer_id
JOIN staff ON rental.staff_id = staff.staff_id

#### 25. Subqueries. Selecting data from another table return. Find payments above average amount

In [ ]:
SELECT *
FROM payment
WHERE amount >
	( SELECT AVG(amount)
	  FROM payment
	 )